# Temperature Rating Dispose Method

Source: https://www.revitapidocs.com/2026/c558f897-5dc7-688b-774f-4fd498e13475.htm

---

| Temperature Rating Dispose Method |
| --- |

Releases all resources used by the TemperatureRating
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

TemperatureRating Class Autodesk.Revit.DB.Electrical Namespace